src/cf/InformationRegisters/СчетчикиПодсказок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиПодсказок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПодсказки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодсказок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СчетчикиПодсказок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак того, что значение счетчика для отображения подсказок
// пользователю превысило граничное значение. В случае если значение 
// не превышено, значение счетчика в ИБ увеличивается.
//
// Параметры:
//  ВидПодсказки 		- ПеречислениеСсылка.ВидыПодсказок - вид подсказки
//               		для получения значения счетчика.
//  ГраничноеЗначение 	- Число - граничное значение счетчика, по достижению
//                    	которого подсказка не должна отображаться пользователю.
//  Пользователь 		- СправочникСсылка.Пользователи - пользователь.
//               		Если не указан, то используется текущий пользователь.
//  Организация 		- СправочникСсылка.Организации - организация.
//               		Если не указана, то используется пустая ссылка.
//  АвтоИнкремент 		- Булево - значение счетчика будет увеличено после
//                      обращения к функции.
// 
// Возвращаемое значение:
//  Булево - признак того, что значение выбранного счетчика превышено
//
Функция ПревышеноЗначение(Знач ВидПодсказки, Знач ГраничноеЗначение, Знач Пользователь = Неопределено, Знач Организация = Неопределено, Знач АвтоИнкремент = Истина) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПодсказки", ВидПодсказки);
	Отбор.Вставить("Пользователь", Пользователь);
	Отбор.Вставить("Организация", Организация);
	
	ЗначениеСчетчика = Получить(Отбор).Счетчик + 1;
	
	Если ЗначениеСчетчика > ГраничноеЗначение Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если АвтоИнкремент Тогда
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидПодсказки = ВидПодсказки;
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Организация = Организация;
		МенеджерЗаписи.Счетчик = ЗначениеСчетчика;
		МенеджерЗаписи.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Увеличивает значение счетчика для указанного вида подсказки.
//
// Параметры:
//  ВидПодсказки 		- ПеречислениеСсылка.ВидыПодсказок - вид подсказки
//               		для увеличения значения счетчика.
//  Пользователь 		- СправочникСсылка.Пользователи - пользователь.
//               		Если не указан, то используется текущий пользователь.
//  Организация 		- СправочникСсылка.Организации - организация.
//               		Если не указана, то используется пустая ссылка.
//
Процедура УвеличитьЗначениеСчетчика(Знач ВидПодсказки, Знач Пользователь = Неопределено, Знач Организация = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВидПодсказки = ВидПодсказки;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ВидПодсказки = ВидПодсказки;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Счетчик = МенеджерЗаписи.Счетчик + 1;
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Записывает в счетчик граничное значение, таким образом, отображение
// подсказки для указанного вида в дальнейшем отключается
//
// Параметры:
//  ВидПодсказки		 - ПеречислениеСсылка.ВидПодсказки - вид подсказки, для которого
//              		следует отключить счетчик.
//  ГраничноеЗначение	 - Число - граничное значение, которое будет записано в регистр,
//                   	таким образом подсказки данного вида будут отключены.
//  Пользователь		 - СправочникСсылка.Пользователи - пользователь. Если не указан,
//              		то используется текущий пользователь.
//  Организация			 - СправочникСсылка.Организация - организация. Если не указана,
//              		то используется пустая ссылка.
//
Процедура ОтключитьСчетчик(Знач ВидПодсказки, Знач ГраничноеЗначение, Знач Пользователь = Неопределено, Знач Организация = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВидПодсказки = ВидПодсказки;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Счетчик = ГраничноеЗначение;
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Сбрасывает значение указанного вида счетчика.
//
// Параметры:
//  ВидПодсказки - ПеречислениеСсылка.ВидыПодсказок - вид подсказски для
//                 сброса значения счетчика.
//  Пользователь - СправочникСсылка.Пользователи - пользователь.
//                 Если не указан, то используется текущий пользователь.
//  Организация - СправочникСсылка.Организации - организация.
//                 Если не указана, то используется пустая ссылка.
//
Процедура Сбросить(Знач ВидПодсказки, Знач Пользователь = Неопределено, Знач Организация = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВидПодсказки = ВидПодсказки;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Удалить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоАвторизованныйПользователь(Пользователь)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
